#include "defines.h"
#include "Hint.h"
#include "Menu/MenuItems.h"
#include <stm32f4xx_hal.h>
#include <cstring>


// ѕолный текст подсказки дл€ последнего использованного итема
static char hint[100];
// »тем, дл€ которого действует подсказка
static const Item *item = nullptr;
// ¬рем€ окончани€ отображени€ подсказки
static uint timeHideHint;

/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
void Hint::Create(const Item *i)
{
    item = i;
    item->CreateHint(hint);
    timeHideHint = HAL_GetTick() + 5000;
}

//-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
char *Hint::Text()
{
    return HAL_GetTick() <  timeHideHint ? hint : "";
}

//-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
const Item *Hint::UnderItem()
{
    return item;
}

//-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
void Hint::Hide()
{
    hint[0] = 0;
    item = nullptr;
    timeHideHint = HAL_GetTick() - 1;
}
