#include "defines.h"
#include "PageModes.h"
#include "Menu/MenuItems.h"
#include "Display/Primitives.h"
#include "Display/Text.h"


using namespace Display::Primitives;
using namespace Display;

static void OnPressFreq();
//-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
static uint8 modeFreq = 0;

MeasureFrequency PageModes::ModeMeasureFrequency()
{
    return (MeasureFrequency)modeFreq;
}

/// Выбор режима измерения частоты, отношения частот, "тахометра"
static Switch sFrequency("f", &modeFreq, 5, &OnPressFreq);

//-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
/// Выбор режима измерения периода
static Button bPeriod("T");

//-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
/// Выбор режима измерения длительности импульсов, интервалов, коэффициента заполнения, разности фаз
static Button bDuration("t");

//-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
/// Выбор режима счёта импульсов
static Button bCountPulse("Счёт");

//-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
/// Выбор периода меток времени
static Button bPeriodTimeLabels("Метки");

//-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
/// Выбор времени измерения
static Button bTimeMeasure("Время");

//-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
/// Выбор числа усредняемых периодов входного сигнала
static Button bNumberPeriods("N");

//-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------


static Item *items[] =
{
    &sFrequency,
    &bPeriod,
    &bDuration,
    &bCountPulse,
    &bPeriodTimeLabels,
    &bTimeMeasure,
    nullptr
};

static void OnPressFreq()
{
    if((MeasureFrequency)modeFreq == _AC || (MeasureFrequency)modeFreq == _fT)
    {
        items[5] = &bNumberPeriods;
    }
    else
    {
        items[5] = &bTimeMeasure;
    }

}

static Page pageModes(items);

Page *PageModes::self = &pageModes;
