#include "defines.h"
#include "PageModes.h"
#include "Menu/MenuItems.h"
#include "Display/Primitives.h"
#include "Display/Text.h"


using namespace Display::Primitives;
using namespace Display;


uint8 modeFreq = 0;
uint8 maxFreq = 4;
void FreqMode()
{
    switch(modeFreq)
    {
        case 0:
            Text("Режим частота 1").Write(10, 35, 10);
        case 1:
            Text("Режим частота 2").Write(10, 35, 10);
        case 2:
            Text("Режим частота 3").Write(10, 35, 10);
        case 3:
            Text("Режим частота 4").Write(10, 35, 10);
    }
}

static Switch bFreq("f", &FreqMode, &modeFreq, &maxFreq);

//-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
/// Выбор режима измерения частоты, отношения частот, "тахометра"
static Button bFrequency("f");

//-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
/// Выбор режима измерения периода
static Button bPeriod("T");

//-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
/// Выбор режима измерения длительности импульсов, интервалов, коэффициента заполнения, разности фаз
static Button bDuration("t");

//-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
/// Выбор режима счёта импульсов
static Button bCountPulse("Счёт");

//-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
/// Выбор периода меток времени
static Button bPeriodTimeLabels("Метки");

//-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
/// Выбор времени измерения
static Button bTimeMeasure("Время");

//-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
/// Выбор числа усредняемых периодов входного сигнала
static Button bNumberPeriods("N");

//-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------


static Item *items[] =
{
    &bFrequency,
    &bPeriod,
    &bDuration,
    &bCountPulse,
    &bPeriodTimeLabels,
    &bTimeMeasure,
    nullptr
};

static Page pageModes(items);

Page *PageModes::self = &pageModes;
