			//Измерительные каналы
#define Chan_A		(char) 0
#define Chan_B		(char) 2
#define Chan_C		(char) 1
#define NON			(char) 255

			//Логические константы
#define TRUE	1
#define FALSE	0

			//Команды частотомера
#define CHANNEL_C		(char) 0
#define RESISTANCE_C	(char) 1
#define DIVIDER_C		(char) 2
#define INPUT_C			(char) 3
#define FRONT_C			(char) 4
#define LF_C			(char) 5
#define MODE_C			(char) 6
#define NOTCH_C			(char) 7
#define MEASTIME_C		(char) 8
#define GENERATOR_C		(char) 9
#define STARTING_C		(char) 10
#define INDTIME_C		(char) 11
#define MEMORY_C		(char) 12

//======================
		//Структура битовых переменных

//======================
		//Структура двоично-десятичной переменной
struct RES
{
	long Data;
	signed char Order;
	signed char IndOrder;
//	char nz;
} RES_Dat, RES_Temp;
//======================
	//Константы начальной установки
#define Set0	(char) Chan_A	//Канал А
#define Set1	(char) 0		//1 МОм
#define Set2	(char) 0		//1:1
#define Set3	(char) 0		//Открытый вход
#define Set4	(char) 0		//Фронт +
#define Set5	(char) 1		//ФНЧ откл
#define Set6	(char) 0		//Частота f
#define Set7	(char) 0		//Метки 10 нс
#define Set8 	(char) 0		//Время счета 1мс
#define Set9 	(char) 0		//Внутренний ОГ
#define Set10	(char) 0		//Ист зап внутр
#define Set11	(char) 0		//Время инд 0,1с
#define Set12	(char) TRUE		//Память вкл
#define Set13	(char) 0		//Ручной
#define Set14	(char) 0		//Режим измерения

	//Таблица команд начальной установки
//int StartSet[15] =
//{
	//(0b00000000000 | Set0),		//Канал А
	//(0b00001000000 | Set1),		//1 МОм
	//(0b00010000000 | Set2),		//1:1
	//(0b00011000000 | Set3),		//Открытый вход
	//(0b00100000000 | Set4),		//Фронт +
	//(0b00101000000 | Set5),		//ФНЧ откл
	//(0b00110000000 | Set6),		//Частота f
	//(0b00111000000 | Set7),		//Метки 10 нс
	//(0b01000000000 | Set8),		//Время счета 1мс
	//(0b01001000000 | Set9),		//Внутренний ОГ
	//(0b01010000000 | Set10),	//Ист зап внутр
	//(0b01011000000 | Set11),	//Время инд 0,1с
	//(0b01100000000 | Set12),	//Память откл
	//(0b01101000000 | Set13),	//Ручной
	//(0b01111000000 | Set14)		//Режим измерения
//};
//--------------------------------

//--------------------------------
unsigned char NormalMode[]	= {12,	 0, 1, 4, 16, 32, 33, 34, 35, 48, 49, 50, 51};		//Список констант режимов вычисления отношения
unsigned char TEST_Const[]	= {10,	 0, 3, 4, 16, 17, 32, 34, 36, 37, 48};				//Список констант режимов для включения режима ТЕСТ
unsigned char CNT_Const[]	= {5,	 1, 2, 4, 36, 37};									//Список констант режимов c безразмерным результатом
unsigned char Point_Const[]	= {15,	 0, 1, 2, 4, 16, 32, 33, 34, 35, 36, 48, 49, 50, 51, 52};		//Список констант режимов с фиксированной запятой
unsigned char Ave_Const[]	= {6,	 1, 3, 16, 33, 50, 51};								//Список констант режимов где отображается число усредняемых периодов
unsigned char N_B_Const[]	= {4,	 1, 2, 50, 51};										//Список констант режимов канала В где требуется отображать N
unsigned char M_Const[]		= {2,	 4, 48};											//Список констант режимов где требуется принудительно гасить символ М


//--------------------------------
//--------------------------
char* StringErr[] =		//Строки - Ошибки
{
	"-102,\"Syntax error\"",				//Синтаксическая ошибка
	"-128,\"Numeric data not allowed\"",	//Недопустимое числовое значение
	"-221,\"Settings conflict\"",			//Конфликт установок
	"-108,\"Parameter not allowed\"",		//Недозволенный параметр
	"-100,\"Command error\"",				//Ошибка команды
};
//--------------------------
		//Указатели на строки единиц измерения
char* String16[]= {"   ", "nHz", "uHz", "mHz", "Hz ", "kHz", "MHz", "GHz", "OL "};
char* String17[]= {"   ", "ns ", "us ", "ms ", "s  ", "OL "};
char* String18[]= {"   ", "ns ", "us ", "ms ", "s  ", "OL "};
char* String19[]= {"   ", "E-9", "E-6", "E-3", "   ", "E3 ", "E6 ", "E9 ", "E10"};

char**   MeasLable[4] = {String16, String17, String18, String19};
//======================*/

#define Y0		(char) 47
#define Y1		(char) 56
#define Y2		(char) 62
#define X0		(char) 1
#define X1		(char) 33

//======================*/
			//В следующих регистрах хранятся все настройки прибора
	char Channel = Set0;		//Номер канала

	char Rin[2] = 		{Set1, Set1};			//Настройки входного сопротивления
	char Kin[2] = 		{Set2, Set2};			//Настройки входного делителя
	char OpenClose[2] = {Set3, Set3};			//Настройки входа
	char Rise[2] =		{Set4, Set4};			//Настройки фронта синхронизации 
	char LF[2] =		{Set5, Set5};			//Настройки входного ФНЧ
	char Synch[2] = 	{Set13, Set13};			//Выбор фиксированных значений уровней синхронизации
	int Level[2] = 		{0, 0};			//Ручная установка уровня синхронизации

	char Mode[1] = 			{Set6};		//Режим работы
	char Notch[1] = 		{Set7};		//Настройка временных меток
	char MeasTime[1] =		{Set8};		//Настройка времени измерения
//	char Average[1] =		{0};		//Настройка числа усреднений

	char IndTime[1] = 		{Set11};		//Настройка времени индикации
	char Generator[1] =		{Set9};		//Настройка опорного генератора
	char Starting[1] =		{Set10};		//Источник запуска измерения

	char Memory[1] =		{Set12};		//Включение режима ПАМЯТЬ

	int Calibration; 			//Калибровочная константа	(Значение актуально только в режиме калибровки)
//-------------------------------------------------------
		//Массив размеров трех разделов меню

char MenuSize[3] = {6, 6, 5};
//-------------------------------------------------------
		//Структуры Функциональных клавиш меню и массив указателей на них
//111111111111111111111111111111111//
char* String0[] =	{"1 МОм", "50 Ом"};		//Строка - состояние 1-й функциональной клавиши
struct struct_1
{
	char Command;					//Номер команды для обращения к плате частотомера
	char MIN_1;						//Минимальное значение переменной  Data
	char MAX_1;						//Максимальное значение переменной  Data
	char *Data;						//Указатель на массив, хранящий значение функциональной клавиши
	char** StateLable;		//Указатель на массив, хранящий строки отображения состояния клавиши
	char KeysImg[37]; 				//Графический массив иконки
	char String1_lng[30];			//Строка - длинное имя клавиши меню
} STR4 = {
	1, 0, 1, Rin, String0,
	35, 1, 0xFF, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0xFD, 0x25, 0x25, 0x59, 0x81, 0x01, 0xF9, 0xA9, 0xA9, 0x51, 0x01, 0x89, 0x51, 0x21, 0x51, 0x89, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0xFF,
	"Входное сопротивление канала:"};


char* String1[] =	{"1:1", "1:10"};		//Строка - состояние 2-й функциональной клавиши
struct
{
	char Command;					//Номер команды для обращения к плате частотомера
	char MIN_1;						//Минимальное значение переменной  Data
	char MAX_1;						//Максимальное значение переменной  Data
	char *Data;						//Указатель на массив, хранящий значение функциональной клавиши
	char** StateLable;		//Указатель на массив, хранящий строки отображения состояния клавиши
	char KeysImg[37]; 				//Графический массив иконки
	char String1_lng[23];			//Строка - длинное имя клавиши меню
} STR5 = {
	2, 0, 1, Kin, String1,
	35, 1, 0xFF, 0x01, 0x01, 0x01, 0x05, 0x9F, 0x41, 0x21, 0x11, 0x09, 0x25, 0xF1, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x05, 0x9F, 0x41, 0x21, 0x11, 0x09, 0x25, 0xF1, 0x01, 0xF1, 0x91, 0xF1, 0x01, 0x01, 0xFF,
	"Настройка аттенюатора:"};

char* String2[] =	{"Фронт \x93", "Срез \x94"};		//Строка - состояние 3-й функциональной клавиши
struct
{
	char Command;					//Номер команды для обращения к плате частотомера
	char MIN_1;						//Минимальное значение переменной  Data
	char MAX_1;						//Максимальное значение переменной  Data
	char *Data;						//Указатель на массив, хранящий значение функциональной клавиши
	char** StateLable;		//Указатель на массив, хранящий строки отображения состояния клавиши
	char KeysImg[37]; 				//Графический массив иконки
	char String1_lng[27];			//Строка - длинное имя клавиши меню
} STR6 = {
	4, 0, 1, Rise, String2,
	35, 1, 0xFF, 0x01, 0x01, 0x01, 0x01, 0x01, 0x81, 0xA1, 0x91, 0xFD, 0x15, 0x25, 0x05, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x05, 0x15, 0x25, 0xFD, 0xA1, 0x91, 0x81, 0x01, 0x01, 0x01, 0x01, 0x01, 0xFF,
	"Выбор фронта синхронизации"};

char* String3[] =	{"Вкл.", "Откл."};		//Строка - состояние 4-й функциональной клавиши
struct
{
	char Command;					//Номер команды для обращения к плате частотомера
	char MIN_1;						//Минимальное значение переменной  Data
	char MAX_1;						//Максимальное значение переменной  Data
	char *Data;						//Указатель на массив, хранящий значение функциональной клавиши
	char** StateLable;		//Указатель на массив, хранящий строки отображения состояния клавиши
	char KeysImg[37]; 				//Графический массив иконки
	char String1_lng[13];			//Строка - длинное имя клавиши меню
} STR7 = {
	5, 0, 1, LF, String3,
	35, 1, 0xFF, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x39, 0x45, 0xFD, 0x45, 0x39, 0x01, 0xFD, 0x21, 0x21, 0xFD, 0x01, 0x1D, 0x21, 0x21, 0xFD, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0xFF,
	"Входной ФНЧ:"};

char* String4[] =	{"ТТЛ", "ЭСЛ"};		//Строка - состояние 5-й функциональной клавиши
struct
{
	char Command;					//Номер команды для обращения к плате частотомера
	char MIN_1;						//Минимальное значение переменной  Data
	char MAX_1;						//Максимальное значение переменной  Data
	char *Data;						//Указатель на массив, хранящий значение функциональной клавиши
	char** StateLable;		//Указатель на массив, хранящий строки отображения состояния клавиши
	char KeysImg[37]; 				//Графический массив иконки
	char String1_lng[31];			//Строка - длинное имя клавиши меню
} STR8 = {
	0x0D, 0, 1, Synch, String4,
	35, 1, 0xFF, 0x01, 0x01, 0x01, 0x79, 0x85, 0x85, 0x85, 0x49, 0x01, 0xF9, 0x41, 0x21, 0x11, 0xF9, 0x01, 0xF9, 0x21, 0x21, 0xF9, 0x01, 0x89, 0x51, 0x21, 0x51, 0x89, 0x01, 0xF9, 0x29, 0x29, 0x11, 0x01, 0x01, 0x01, 0xFF,
	"Выбор режима синхронизации:"};

char* String5[] =	{"Откр. вход", "Закр. вход"};		//Строка - состояние 6-й функциональной клавиши
struct
{
	char Command;					//Номер команды для обращения к плате частотомера
	char MIN_1;						//Минимальное значение переменной  Data
	char MAX_1;						//Максимальное значение переменной  Data
	char *Data;						//Указатель на массив, хранящий значение функциональной клавиши
	char** StateLable;		//Указатель на массив, хранящий строки отображения состояния клавиши
	char KeysImg[37]; 				//Графический массив иконки
	char String1_lng[37];			//Строка - длинное имя клавиши меню
} STR9 = {
	3, 0, 1, OpenClose, String5,
	35, 1, 0xFF, 0x01, 0x01, 0x01, 0x61, 0x31, 0x11, 0x31, 0x61, 0xC1, 0x81, 0xC1, 0x61, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x65, 0x35, 0x15, 0x35, 0x65, 0xC5, 0x85, 0xC5, 0x65, 0x01, 0x01, 0x01, 0xFF,
	"Вход - закрытый /открытый "};

//111111111111111111111111111111111//

//222222222222222222222222222222222//
//		****************
	//Структуры альтернативных режимов клавиш
//Для канала А:
char* String6[] =	{"Частота", "f(A)/f(C)", "f(A)/f(B)", "f=1/T", "Тахометр"};		//Строка - состояние 1-й функциональной клавиши
struct
{
	char Command;					//Номер команды для обращения к плате частотомера
	char MIN_1;						//Минимальное значение переменной  Data
	char MAX_1;						//Максимальное значение переменной  Data
	char *Data;						//Указатель на массив, хранящий значение функциональной клавиши
	char** StateLable;		//Указатель на массив, хранящий строки отображения состояния клавиши
	char KeysImg[37]; 				//Графический массив иконки
	char String1_lng[19];			//Строка - длинное имя клавиши меню
} STR10 = {
	6, 0, 4, Mode, String6,
	35, 1, 0xFF, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x91, 0x7D, 0x13, 0x05, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0xFF,
	"Измерение частоты"};

//Для канала В:
char* String6_1[] =	{"Частота", "f(B)/f(A)", "f(B)/f(C)", "не активен", "не активен"};		//Строка - состояние 1-й функциональной клавиши
struct
{
	char Command;					//Номер команды для обращения к плате частотомера
	char MIN_1;						//Минимальное значение переменной  Data
	char MAX_1;						//Максимальное значение переменной  Data
	char *Data;						//Указатель на массив, хранящий значение функциональной клавиши
	char** StateLable;		//Указатель на массив, хранящий строки отображения состояния клавиши
	char KeysImg[37]; 				//Графический массив иконки
	char String1_lng[19];			//Строка - длинное имя клавиши меню
} STR10_1 = {
	6, 0, 2, Mode, String6_1,
	35, 1, 0xFF, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x91, 0x7D, 0x13, 0x05, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0xFF,
	"Измерение частоты"};

//Для канала С:
char* String6_2[] =	{"Частота", "f(C)/f(A)", "f(C)/f(B)", "f=1/T", "Тахометр"};		//Строка - состояние 1-й функциональной клавиши
struct
{
	char Command;					//Номер команды для обращения к плате частотомера
	char MIN_1;						//Минимальное значение переменной  Data
	char MAX_1;						//Максимальное значение переменной  Data
	char *Data;						//Указатель на массив, хранящий значение функциональной клавиши
	char** StateLable;		//Указатель на массив, хранящий строки отображения состояния клавиши
	char KeysImg[37]; 				//Графический массив иконки
	char String1_lng[19];			//Строка - длинное имя клавиши меню
} STR10_2 = {
	6, 0, 4, Mode, String6_2,
	35, 1, 0xFF, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x91, 0x7D, 0x13, 0x05, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0xFF,
	"Измерение частоты"};

//		****************

char* String7[] =	{"Период", "Т=1/f"};		//Строка - состояние 2-й функциональной клавиши
struct
{
	char Command;					//Номер команды для обращения к плате частотомера
	char MIN_1;						//Минимальное значение переменной  Data
	char MAX_1;						//Максимальное значение переменной  Data
	char *Data;						//Указатель на массив, хранящий значение функциональной клавиши
	char** StateLable;		//Указатель на массив, хранящий строки отображения состояния клавиши
	char KeysImg[37]; 				//Графический массив иконки
	char String1_lng[18];			//Строка - длинное имя клавиши меню
} STR11 = {
	6, 16, 17, Mode, String7,
	35, 1, 0xFF, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x05, 0x05, 0xFD, 0x05, 0x05, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0xFF,
	"Измерение периода"};

//		****************
	//Структуры альтернативных режимов клавиш
//Для канала А:
char* String8[] =	{"n\x98t", "<n\x98t>", "n\x98t/1нс", "Интервал", "1/S", "Фаза"};		//Строка - состояние 3-й функциональной клавиши
struct
{
	char Command;					//Номер команды для обращения к плате частотомера
	char MIN_1;						//Минимальное значение переменной  Data
	char MAX_1;						//Максимальное значение переменной  Data
	char *Data;						//Указатель на массив, хранящий значение функциональной клавиши
	char** StateLable;		//Указатель на массив, хранящий строки отображения состояния клавиши
	char KeysImg[37]; 				//Графический массив иконки
	char String1_lng[23];			//Строка - длинное имя клавиши меню
} STR12 = {
	6, 32, 37, Mode, String8,
	35, 1, 0xFF, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x09, 0x05, 0x75, 0x8D, 0x85, 0x45, 0x03, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0xFF,
	"Измерение длительности"};

//Для канала С:
char* String8_1[] =	{"n\x98t", "<n\x98t>", "n\x98t/1нс",  "Интервал", "1/S", "Фаза"};		//Строка - состояние 3-й функциональной клавиши
struct
{
	char Command;					//Номер команды для обращения к плате частотомера
	char MIN_1;						//Минимальное значение переменной  Data
	char MAX_1;						//Максимальное значение переменной  Data
	char *Data;						//Указатель на массив, хранящий значение функциональной клавиши
	char** StateLable;		//Указатель на массив, хранящий строки отображения состояния клавиши
	char KeysImg[37]; 				//Графический массив иконки
	char String1_lng[23];			//Строка - длинное имя клавиши меню
} STR12_1 = {
	6, 32, 37, Mode, String8_1,
	35, 1, 0xFF, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x09, 0x05, 0x75, 0x8D, 0x85, 0x45, 0x03, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0xFF,
	"Измерение длительности"};

//		****************
//		****************
	//Структуры альтернативных режимов клавиш
//Для канала А:
char* String9[] =	{"Ручн", "A(\x95\C)", "A(TC)", "не активен"};		//Строка - состояние 4-й функциональной клавиши
struct
{
	char Command;					//Номер команды для обращения к плате частотомера
	char MIN_1;						//Минимальное значение переменной  Data
	char MAX_1;						//Максимальное значение переменной  Data
	char *Data;						//Указатель на массив, хранящий значение функциональной клавиши
	char** StateLable;		//Указатель на массив, хранящий строки отображения состояния клавиши
	char KeysImg[37]; 				//Графический массив иконки
	char String1_lng[21];			//Строка - длинное имя клавиши меню
} STR13 = {
	6, 48, 50, Mode, String9,
	35, 1, 0xFF, 0x01, 0x01, 0x01, 0x01, 0x01, 0x79, 0x85, 0x85, 0x85, 0x49, 0x01, 0x19, 0x21, 0x21, 0xF9, 0x01, 0x71, 0xA9, 0xA9, 0xA9, 0x11, 0x01, 0x09, 0x09, 0xF9, 0x09, 0x09, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0xFF,
	"Счет числа импульсов"};

//Для канала В:
char* String9_1[] =	{"B(\x95\А)", "B(\x95\C)", "B(TA)", "B(TC)"};		//Строка - состояние 4-й функциональной клавиши
struct
{
	char Command;					//Номер команды для обращения к плате частотомера
	char MIN_1;						//Минимальное значение переменной  Data
	char MAX_1;						//Максимальное значение переменной  Data
	char *Data;						//Указатель на массив, хранящий значение функциональной клавиши
	char** StateLable;		//Указатель на массив, хранящий строки отображения состояния клавиши
	char KeysImg[37]; 				//Графический массив иконки
	char String1_lng[21];			//Строка - длинное имя клавиши меню
} STR13_1 = {
	6, 48, 51, Mode, String9_1,
	35, 1, 0xFF, 0x01, 0x01, 0x01, 0x01, 0x01, 0x79, 0x85, 0x85, 0x85, 0x49, 0x01, 0x19, 0x21, 0x21, 0xF9, 0x01, 0x71, 0xA9, 0xA9, 0xA9, 0x11, 0x01, 0x09, 0x09, 0xF9, 0x09, 0x09, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0xFF,
	"Счет числа импульсов"};

//Для канала С:
char* String9_2[] =	{"Ручн.", "C(\x95\А)", "C(TA)", "не активен"};		//Строка - состояние 4-й функциональной клавиши
struct
{
	char Command;					//Номер команды для обращения к плате частотомера
	char MIN_1;						//Минимальное значение переменной  Data
	char MAX_1;						//Максимальное значение переменной  Data
	char *Data;						//Указатель на массив, хранящий значение функциональной клавиши
	char** StateLable;		//Указатель на массив, хранящий строки отображения состояния клавиши
	char KeysImg[37]; 				//Графический массив иконки
	char String1_lng[21];			//Строка - длинное имя клавиши меню
} STR13_2 = {
	6, 48, 50, Mode, String9_2,
	35, 1, 0xFF, 0x01, 0x01, 0x01, 0x01, 0x01, 0x79, 0x85, 0x85, 0x85, 0x49, 0x01, 0x19, 0x21, 0x21, 0xF9, 0x01, 0x71, 0xA9, 0xA9, 0xA9, 0x11, 0x01, 0x09, 0x09, 0xF9, 0x09, 0x09, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0xFF,
	"Счет числа импульсов"};

//		****************

char* String10[] =	{"10-8", "10-7", "10-6", "10-5", "10-4", "10-3"};		//Строка - состояние 5-й функциональной клавиши
struct
{
	char Command;					//Номер команды для обращения к плате частотомера
	char MIN_1;						//Минимальное значение переменной  Data
	char MAX_1;						//Максимальное значение переменной  Data
	char *Data;						//Указатель на массив, хранящий значение функциональной клавиши
	char** StateLable;		//Указатель на массив, хранящий строки отображения состояния клавиши
	char KeysImg[37]; 				//Графический массив иконки
	char String1_lng[30];			//Строка - длинное имя клавиши меню
} STR14 = {
	7, 0, 5, Notch, String10,
	35, 1, 0xFF, 0x01, 0x01, 0xFD, 0x09, 0x11, 0x09, 0xFD, 0x01, 0x71, 0xA9, 0xA9, 0xA9, 0x11, 0x01, 0x09, 0x09, 0xF9, 0x09, 0x09, 0x01, 0xF9, 0x21, 0x51, 0x89, 0x01, 0xF9, 0x41, 0x21, 0x11, 0xF9, 0x01, 0x01, 0x01, 0xFF,
	"Длительность временных меток:"};

//		****************
	//Структуры альтернативных режимов клавиш
//Время:
char* String11[] =	{" 1ms", "10ms", "100ms", " 1s", " 10s", "100s"};		//Строка - состояние 6-й функциональной клавиши
struct
{
	char Command;					//Номер команды для обращения к плате частотомера
	char MIN_1;						//Минимальное значение переменной  Data
	char MAX_1;						//Максимальное значение переменной  Data
	char *Data;						//Указатель на массив, хранящий значение функциональной клавиши
	char** StateLable;		//Указатель на массив, хранящий строки отображения состояния клавиши
	char KeysImg[37]; 				//Графический массив иконки
	char String1_lng[12];			//Строка - длинное имя клавиши меню
} STR15 = {
	8, 0, 5, MeasTime, String11,
	35, 1, 0xFF, 0x01, 0x01, 0x01, 0xFD, 0x95, 0x95, 0x69, 0x01, 0xF9, 0x29, 0x29, 0x11, 0x01, 0x71, 0xA9, 0xA9, 0xA9, 0x11, 0x01, 0xF9, 0x11, 0x21, 0x11, 0xF9, 0x01, 0xB1, 0x69, 0x29, 0xF9, 0x01, 0x01, 0x01, 0x01, 0xFF,
	"Время счета"};


//Число усреднений:
char* String10_1[] =	{"  1", " 10", " 100", " 1к", " 10к", "100к"};		//Строка - состояние 5-й функциональной клавиши
struct
{
	char Command;					//Номер команды для обращения к плате частотомера
	char MIN_1;						//Минимальное значение переменной  Data
	char MAX_1;						//Максимальное значение переменной  Data
	char *Data;						//Указатель на массив, хранящий значение функциональной клавиши
	char** StateLable;		//Указатель на массив, хранящий строки отображения состояния клавиши
	char KeysImg[37]; 				//Графический массив иконки
	char String1_lng[30];			//Строка - длинное имя клавиши меню
} STR14_1 = {
	8, 0, 5, MeasTime, String10_1,
	35, 1, 0xFF, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0xFD, 0x09, 0x11, 0x21, 0x41, 0xFD, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0xFF,
	"Число периодов измерения:"};

//Число усреднений для длительности с усреднением:
struct
{
	char Command;					//Номер команды для обращения к плате частотомера
	char MIN_1;						//Минимальное значение переменной  Data
	char MAX_1;						//Максимальное значение переменной  Data
	char *Data;						//Указатель на массив, хранящий значение функциональной клавиши
	char** StateLable;		//Указатель на массив, хранящий строки отображения состояния клавиши
	char KeysImg[37]; 				//Графический массив иконки
	char String1_lng[30];			//Строка - длинное имя клавиши меню
} STR14_2 = {
	8, 1, 5, MeasTime, String10_1,
	35, 1, 0xFF, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0xFD, 0x09, 0x11, 0x21, 0x41, 0xFD, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0xFF,
	"Число периодов измерения:"};

//		****************

//222222222222222222222222222222222//

//333333333333333333333333333333333//
char* String12[] =	{"0.1s.", "1s.", "10s."};		//Строка - состояние 1-й функциональной клавиши
struct
{
	char Command;					//Номер команды для обращения к плате частотомера
	char MIN_1;						//Минимальное значение переменной  Data
	char MAX_1;						//Максимальное значение переменной  Data
	char *Data;						//Указатель на массив, хранящий значение функциональной клавиши
	char** StateLable;		//Указатель на массив, хранящий строки отображения состояния клавиши
	char KeysImg[37]; 				//Графический массив иконки
	char String1_lng[16];			//Строка - длинное имя клавиши меню
} STR16 = {
	11, 0, 2, IndTime, String12,
	35, 1, 0xFF, 0x01, 0x01, 0x05, 0x05, 0xFD, 0x05, 0x05, 0x01, 0x21, 0x21, 0x21, 0x01, 0xFD, 0x41, 0x21, 0x11, 0x09, 0xFD, 0x01, 0xFD, 0x11, 0x11, 0x11, 0xFD, 0x01, 0xC1, 0x7D, 0x45, 0x45, 0x7D, 0xC1, 0x01, 0x01, 0xFF,
	"Время индикации"};

char* String13[] =	{"Внутренний", "Внешний"};		//Строка - состояние 2-й функциональной клавиши
struct
{
	char Command;					//Номер команды для обращения к плате частотомера
	char MIN_1;						//Минимальное значение переменной  Data
	char MAX_1;						//Максимальное значение переменной  Data
	char *Data;						//Указатель на массив, хранящий значение функциональной клавиши
	char** StateLable;		//Указатель на массив, хранящий строки отображения состояния клавиши
	char KeysImg[37]; 				//Графический массив иконки
	char String1_lng[26];			//Строка - длинное имя клавиши меню
} STR17 = {
	9, 0, 1, Generator, String13,
	35, 1, 0xFF, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x79, 0x85, 0x85, 0x85, 0x79, 0x01, 0x01, 0xFD, 0x05, 0x05, 0x05, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0xFF,
	"Выбор опорного генератора"};

char* String14[] =	{"Внутренний", "Внешний", "Однократ."};		//Строка - состояние 3-й функциональной клавиши
struct
{
	char Command;					//Номер команды для обращения к плате частотомера
	char MIN_1;						//Минимальное значение переменной  Data
	char MAX_1;						//Максимальное значение переменной  Data
	char *Data;						//Указатель на массив, хранящий значение функциональной клавиши
	char** StateLable;		//Указатель на массив, хранящий строки отображения состояния клавиши
	char KeysImg[37]; 				//Графический массив иконки
	char String1_lng[24];			//Строка - длинное имя клавиши меню
} STR18 = {
	10, 0, 2, Starting, String14,
	35, 1, 0xFF, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x49, 0x85, 0x95, 0x69, 0x01, 0x61, 0x95, 0x95, 0xF9, 0x01, 0xFD, 0x05, 0x05, 0xFD, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01, 0xFF,
	"Выбор источника запуска"};

char* String15[] =	{"Калибр."};		//Строка - состояние 4-й функциональной клавиши
struct
{
	char Command;					//Номер команды для обращения к плате частотомера
	char MIN_1;						//Минимальное значение переменной  Data
	char MAX_1;						//Максимальное значение переменной  Data
	char *Data;						//Указатель на массив, хранящий значение функциональной клавиши
	char** StateLable;		//Указатель на массив, хранящий строки отображения состояния клавиши
	char KeysImg[37]; 				//Графический массив иконки
	char String1_lng[33];			//Строка - длинное имя клавиши меню
} STR19 = {
	0xF2, CALIBRATE_MODE, CALIBRATE_MODE, &ModeScreen, String15,
	35, 1, 0xFF, 0x01, 0xF9, 0x21, 0x51, 0x89, 0x01, 0x41, 0xA9, 0xA9, 0xF1, 0x01, 0x81, 0x71, 0x09, 0x09, 0xF9, 0x01, 0xF9, 0x41, 0x21, 0x11, 0xF9, 0x01, 0x71, 0xA9, 0xA9, 0x65, 0x01, 0xF9, 0x49, 0x49, 0x31, 0x01, 0xFF,
	"Уст. частоты опорного генератора"};

char* String22[] =	{"Память отк", "Память вкл"};		//Строка - состояние 5-й функциональной клавиши
struct
{
	char Command;					//Номер команды для обращения к плате частотомера
	char MIN_1;						//Минимальное значение переменной  Data
	char MAX_1;						//Максимальное значение переменной  Data
	char *Data;						//Указатель на массив, хранящий значение функциональной клавиши
	char** StateLable;		//Указатель на массив, хранящий строки отображения состояния клавиши
	char KeysImg[37]; 				//Графический массив иконки
	char String1_lng[13];			//Строка - длинное имя клавиши меню
} STR20 = {
	0xC, 0, 1, Memory, String22,
	35, 1, 0xFF, 0x01, 0xFD, 0x05, 0x05, 0xFD, 0x01, 0x41, 0xA9, 0xA9, 0xF1, 0x01, 0xF9, 0x11, 0x21, 0x11, 0xF9, 0x01, 0x91, 0x69, 0x29, 0xF9, 0x01, 0x09, 0x09, 0xF9, 0x09, 0x09, 0x01, 0xF9, 0xA1, 0xA1, 0x41, 0x01, 0xFF,
	"Режим память"};

//		****************
	//Структуры альтернативных режимов клавиш



//		****************
//333333333333333333333333333333333//

struct struct_1 * F0[3][6] =
{
{(struct struct_1 *)&STR9, (struct struct_1 *) &STR4, (struct struct_1 *) &STR7, (struct struct_1 *) &STR6, (struct struct_1 *) &STR5, (struct struct_1 *) &STR8},
//{&STR4, &STR5, &STR6, &STR7, &STR8, &STR9},
{(struct struct_1 *)&STR10, (struct struct_1 *) &STR11, (struct struct_1 *)&STR12, (struct struct_1 *)&STR13, (struct struct_1 *)&STR14, (struct struct_1 *)&STR15},
{(struct struct_1 *)&STR16, (struct struct_1 *)&STR17, (struct struct_1 *)&STR18, (struct struct_1 *)&STR19, (struct struct_1 *)&STR20}
};		//Строка - состояние 1-й функциональной клавиши

struct struct_1 *Level_1[6];
//-------------------------------------------------------
		//Таблица включения второго канала

char TwinChanMode[3][4][6] ={
{			//Канал А
	{NON, Chan_C, Chan_B, NON, NON, NON},		//Частота
	{NON, NON, NON, NON, NON, NON},				//Период
	{NON, NON, NON, Chan_C, NON, Chan_C},		//Длительность
	{NON, Chan_C, Chan_C, NON, NON, NON}		//Счет
},{			//Канал С
	{NON, Chan_A, Chan_B, NON, NON, NON},		//Частота
	{NON, NON, NON, NON, NON, NON},				//Период
	{NON, NON, NON, Chan_A, NON, Chan_A},		//Длительность
	{NON, Chan_A, Chan_A, NON, NON, NON}		//Счет
},{			//Канал В
	{NON, Chan_A, Chan_C, NON, NON, NON},		//Частота
	{NON, NON, NON, NON, NON, NON},				//Период
	{NON, NON, NON, NON, NON, NON},				//Длительность
	{Chan_A, Chan_C, Chan_A, Chan_C, NON, NON}	//Счет
}};
//-------------------------------------------------------

char ConstTime[] = {0, 0, 0, 200, 20, 2};		//Таблица для расчета скорости движения индикатора времени счета
//-------------------------------------------------------

char* String20[] =	{"Зап.внешн", "Зап.Одн."};		//Строки - сообшения о режиме запуска измерений
char String21[] =	{"ОГ внешн."};							//Строка - сообшение о выбраном опорном генераторе
//-------------------------------------------------------
char* String23[] =	{"не активен", "не активен", "не активен", "не активен", "не активен", "не активен",};		//
char** ModeString[3][4] =			//Массив указателей на строковые указатели подрежимов работы

{	//Частота		Период		Длительность	Счет
	{String6,		String7,	String8,		String9},		//Канал А
	{String6_2,	String7,	String8_1,		String9_2},		//Канал C
	{String6_1,	String23,	String23,		String9_1}	//Канал B
};
//-------------------------------------------------------
//-------------------------------------------------------
//----------------------------------------------------
char* String24[] =		//Строки - 	"0", 
{
	"\x16",				//Количество строк в массиве + 2
	"\x16",

	#define Input		0
	"input",
	"inp",

	#define Initiate	1
	"initiate",
	"init",

	#define Trigger		2
	"trigger",
	"trig",

	#define Configure	3
	"configure",
	"conf",

	#define Measure		4
	"measure",
	"meas",

	#define Read		5
	"read",
	"read",

	#define RST			6
	"*rst",
	"rst",

	#define CLS			7
	"*cls",
	"cls",

	#define IDN			8
	"*idn",
	"idn",

	#define ERRor		9
	"error",
	"err",
};
//----------------------------------------------------
char* String25[] =		//Строки - input
{
	"\x0A",				//Количество строк в массиве + 2
	"\x0A",

	#define Coupling	0
	"coupling",			//0
	"coup",				//0

	#define Filter		1
	"filter",			//1
	"filt",				//1

	#define Impedance	2
	"impedance",		//2
	"imp",				//2

	#define Divider		3
	"divider",			//3
	"div"				//3
};
//--------------------------
char* String26[] =		//Строки - coupling
{
	"\x06",				//Количество строк в массиве + 2
	"\x06",

	#define DC			0
	"open",			//0
	"dc",				//0

	#define AC			1
	"close",				//1
	"ac",				//1
};
//--------------------------
char* String27[] =		//Строки - filter
{
	"\x06",				//Количество строк в массиве + 2
	"\x06",

	#define ON			0
	"on",				//0
	"on",				//0

	#define OFF			1
	"off",				//1
	"off"				//1
};
//--------------------------
char* String28[] =		//Строки - impedance
{
	"\x06",				//Количество строк в массиве + 2
	"\x06",

	#define le6			0
	"1e6",				//0
	"1m",				//0

	#define _50			1
	"50",				//1
	"5e1"				//1
};
//--------------------------
char* String29[] =		//Строки - divider
{
	"\x06",				//Количество строк в массиве + 2
	"\x06",

	#define _1			0
	"1",				//0
	"1",				//0

	#define _10			1
	"10",				//1
	"10"				//1
};
//--------------------------
char** Point_2[4] =	{String26, String27, String28, String29};
//----------------------------------------------------
//----------------------------------------------------
char* String30[] =		//Строки - initiate
{
	"\x06",				//Количество строк в массиве + 2
	"\x06",

	#define Source		0
	"source",			//0
	"sour",				//0

	#define Timer		1
	"timer",			//1
	"tim"				//1
};
//--------------------------
char* String31[] =		//Строки - source
{
	"\x08",				//Количество строк в массиве + 2
	"\x08",

	#define Internal	0
	"internal",			//0
	"int",				//0

	#define External	1
	"external",			//1
	"ext",				//1

	#define Manual		2
	"manual",			//2
	"man"				//2
};
//--------------------------
char* String32[] =		//Строки - timer
{
	"\x08",				//Количество строк в массиве + 2
	"\x08",

	#define _01			0
	"100m",				//0
	"1e-1",				//0

	#define __1			1
	"1",				//1
	"1e0",				//1

	#define __10		10
	"10",				//10
	"1e1"				//10
};
//--------------------------
char** Point_3[2] =	{String31, String32};
//----------------------------------------------------
//----------------------------------------------------
char* String33[] =		//Строки - trigger
{
	"\x0C",				//Количество строк в массиве + 2
	"\x0C",

	#define Slope		0
	"slope",			//0
	"slop",				//0

	#define Level_M		1
	"level",			//1
	"lev",				//1

	#define Auto_M		2
	"auto",				//2
	"auto",				//2

	#define Esl			3
	"esl",				//3
	"esl",				//3

	#define Ttl			4
	"ttl",				//4
	"ttl",				//4
};
//--------------------------
char* String34[] =		//Строки - slope
{
	"\x06",				//Количество строк в массиве + 2
	"\x06",

	#define Positive	0
	"positive",			//0
	"pos",				//0

	#define Negative	1
	"negative",			//1
	"neg"				//1
};
//--------------------------
char** Point_4[1] =	{String34};
//----------------------------------------------------
//----------------------------------------------------
char* String35[] =		//Строки - Frequnce
{
	"\x0C",				//Количество строк в массиве + 2
	"\x0C",

	#define DIRect		0
	"direct",
	"dir",

	#define LRATio		1
	"lratio",
	"lrat",

	#define HRATio		2
	"hratio",
	"hrat",

	#define _1_T		3
	"1/t",
	"1/t",

	#define TACHometr	4
	"tachometr",
	"tach",
};
//--------------------------
//----------------------------------------------------
char* String36[] =		//Строки - Period
{
	"\x06",				//Количество строк в массиве + 2
	"\x06",

	#define DIRect		0
	"direct",
	"dir",

	#define _1_F		1
	"1/f",
	"1/f",
};
//--------------------------
//----------------------------------------------------
char* String37[] =		//Строки - Width
{
	"\x0E",				//Количество строк в массиве + 2
	"\x0E",

	#define DIRect		0
	"direct",
	"dir",

	#define AVErage		1
	"average",
	"ave",

	#define HDEFinition	2
	"hdefinition",
	"hdef",

	#define INTerval	3
	"interval",
	"int",

	#define DCYCle		4
	"dcycle",
	"dcyc",

	#define PHASe		5
	"phase",
	"phas",
};
//--------------------------
//----------------------------------------------------
char* String38[] =		//Строки - CNT
{
	"\x08",				//Количество строк в массиве + 2
	"\x08",

	#define HANd	0
	"hand",
	"han",

	#define WIDe	1
	"wide",
	"wid",

	#define PERiod	2
	"period",
	"per",
};
//--------------------------
//----------------------------------------------------
char* String39[] =		//Строки - configure
{
	"\x0A",				//Количество строк в массиве + 2
	"\x0A",

	#define Frequnce	0
	"frequency",
	"freq",

	#define Period		1
	"period",
	"per",

	#define Width		2
	"width",
	"wid",

	#define Cnt_M		3
	"cnt",
	"cnt",
};
//--------------------------
//--------------------------
char* String40[] =		//Строки -
{
	"\x06",				//Количество строк в массиве + 2
	"\x06",

	#define SCALar			0
	"scalar",
	"scal",

	#define ARRay			1
	"array",
	"arr"
};
//--------------------------
char** Point_1[4] =	{String35, String36, String37, String38};	//Указатели на массивы подрежимов
//--------------------------
char* String45[] =		//Строки-параметры функции CONfigure
{
	"\x14",				//Количество строк в массиве + 2
	"\x14",


	#define Ch_a		0
	"(@a)",
	"@a",

	#define Ch_c		1
	"(@c)",
	"@c",

	#define Ch_b		2
	"(@b)",
	"@b",


	#define Ch_a_c		3
	"(@a.c)",
	"@a.c",

	#define Ch_c_a		4
	"(@c.a)",
	"@c.a",

	#define Ch_b_a		5
	"(@b.a)",
	"@b.a",


	#define Ch_a_b		6
	"(@a.b)",
	"@a.b",

	#define Ch_c_b		7
	"(@c.b)",
	"@c.b",

	#define Ch_b_c		8
	"(@b.c)",
	"@b.c",
};
//--------------------------
//--------------------------
char* String46[] =		//Строки - числовые константы
{
	"\x1E",				//Количество строк в массиве + 2
	"\x1E",

	#define N_10n		0
	"10n",
	"1e-8",

	#define N_100n		1
	"100n",
	"1e-7",

	#define N_1u		2
	"1u",
	"1e-6",

	#define N_10u		3
	"10u",
	"1e-5",

	#define N_100u		4
	"100u",
	"1e-4",

	#define N_1m		5
	"1m",
	"1e-3",

	#define N_10m		6
	"10m",
	"1e-2",

	#define N_100m		7
	"100m",
	"1e-1",

	#define N_1			8
	"1",
	"1e0",

	#define N_10		9
	"10",
	"1e1",

	#define N_100		10
	"100",
	"1e2",

	#define N_1k		11
	"1k",
	"1e3",

	#define N_10k		12
	"10k",
	"1e4",

	#define N_100k		13
	"100k",
	"1e5",
};
//--------------------------
char** Point_5[18] =	{String24, String25, String26, String27, String28, String29, String30, String31, String32, String33,
String34, String35, String36, String37, String38, String39, String45, String46};
//----------------------------------------------------






//rom char*  ManageReg[8] =	{&OpenClose, &LF, &Rin, &Kin, &Starting, &IndTime, &Rise, &Level};
//
/*//-------------------------------------------------------*/
